; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v9 ?v8)
             (pred_11 ?v4 ?v13)
             (pred_4 ?v9 ?v13)
             (pred_9 ?v2 ?v9 )
	     (pred_8 ?v9)
             (pred_1 ?v10)
             (pred_12 ?v4)
             (pred_2 ?v13)
             (pred_5 ?v9)
             (pred_6 ?v4)
             (pred_7 ?v9)
             (pred_3 ))



(:action op_5
:parameters (?v3 ?v6 ?v1 ?v12)
:precondition (and (pred_1 ?v3) (pred_1 ?v6) (pred_12 ?v1) (pred_2 ?v12)
          (pred_10 ?v3 ?v6) (pred_11 ?v1 ?v12)
                   (pred_4 ?v6 ?v12) (pred_8 ?v3) 
                   (pred_5 ?v6) (pred_6 ?v1))
:effect (and  (pred_7 ?v6) (not (pred_5 ?v6))))


(:action op_3
:parameters (?v3 ?v11)
:precondition (and (pred_1 ?v3) (pred_1 ?v11)
               (pred_8 ?v3) (pred_10 ?v3 ?v11) (pred_7 ?v11))
:effect (and (pred_8 ?v11) (not (pred_8 ?v3))))

(:action op_2
:parameters (?v3 ?v1)
:precondition (and (pred_1 ?v3) (pred_12 ?v1) 
                  (pred_8 ?v3) (pred_9 ?v1 ?v3) (pred_3 ))
:effect (and (pred_6 ?v1)
   (not (pred_9 ?v1 ?v3)) (not (pred_3 ))))


(:action op_4
:parameters (?v3 ?v5 ?v7)
:precondition (and (pred_1 ?v3) (pred_12 ?v5) (pred_12 ?v7)
                  (pred_8 ?v3) (pred_6 ?v7) (pred_9 ?v5 ?v3))
:effect (and (pred_6 ?v5) (pred_9 ?v7 ?v3)
        (not (pred_6 ?v7)) (not (pred_9 ?v5 ?v3))))

(:action op_1
:parameters (?v3 ?v1)
:precondition (and (pred_1 ?v3) (pred_12 ?v1) 
                  (pred_8 ?v3) (pred_6 ?v1))
:effect (and (pred_3 ) (pred_9 ?v1 ?v3) (not (pred_6 ?v1)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_23 obj_21 obj_30 obj_15 obj_03 obj_22 obj_08 obj_26 obj_24 obj_25 obj_16 obj_18 obj_11 obj_19 obj_07 obj_10 obj_17 obj_14 obj_06 obj_01 obj_04 obj_20 obj_13 obj_05 obj_27
    obj_02 obj_28
    obj_12 obj_29 obj_09
    )

    (:init
       (pred_3)

       (pred_1 obj_23)
       (pred_1 obj_21)
       (pred_1 obj_30)
       (pred_1 obj_15)
       (pred_1 obj_03)
       (pred_1 obj_22)
       (pred_1 obj_08)
       (pred_1 obj_26)
       (pred_1 obj_24)
       (pred_1 obj_25)
       (pred_1 obj_16)
       (pred_1 obj_18)
       (pred_1 obj_11)
       (pred_1 obj_19)
       (pred_1 obj_07)
       (pred_1 obj_10)
       (pred_1 obj_17)
       (pred_1 obj_14)
       (pred_1 obj_06)
       (pred_1 obj_01)
       (pred_1 obj_04)
       (pred_1 obj_20)
       (pred_1 obj_13)
       (pred_1 obj_05)
       (pred_1 obj_27)
       (pred_2 obj_02)
       (pred_2 obj_28)
       (pred_12 obj_12)
       (pred_12 obj_29)
       (pred_12 obj_09)

       (pred_10 obj_23 obj_22)
       (pred_10 obj_23 obj_21)
       (pred_10 obj_21 obj_08)
       (pred_10 obj_21 obj_30)
       (pred_10 obj_21 obj_23)
       (pred_10 obj_30 obj_26)
       (pred_10 obj_30 obj_15)
       (pred_10 obj_30 obj_21)
       (pred_10 obj_15 obj_24)
       (pred_10 obj_15 obj_03)
       (pred_10 obj_15 obj_30)
       (pred_10 obj_03 obj_25)
       (pred_10 obj_03 obj_15)
       (pred_10 obj_22 obj_16)
       (pred_10 obj_22 obj_08)
       (pred_10 obj_22 obj_23)
       (pred_10 obj_08 obj_18)
       (pred_10 obj_08 obj_26)
       (pred_10 obj_08 obj_21)
       (pred_10 obj_08 obj_22)
       (pred_10 obj_26 obj_11)
       (pred_10 obj_26 obj_24)
       (pred_10 obj_26 obj_30)
       (pred_10 obj_26 obj_08)
       (pred_10 obj_24 obj_19)
       (pred_10 obj_24 obj_25)
       (pred_10 obj_24 obj_15)
       (pred_10 obj_24 obj_26)
       (pred_10 obj_25 obj_07)
       (pred_10 obj_25 obj_03)
       (pred_10 obj_25 obj_24)
       (pred_10 obj_16 obj_10)
       (pred_10 obj_16 obj_18)
       (pred_10 obj_16 obj_22)
       (pred_10 obj_18 obj_17)
       (pred_10 obj_18 obj_11)
       (pred_10 obj_18 obj_08)
       (pred_10 obj_18 obj_16)
       (pred_10 obj_11 obj_14)
       (pred_10 obj_11 obj_19)
       (pred_10 obj_11 obj_26)
       (pred_10 obj_11 obj_18)
       (pred_10 obj_19 obj_06)
       (pred_10 obj_19 obj_07)
       (pred_10 obj_19 obj_24)
       (pred_10 obj_19 obj_11)
       (pred_10 obj_07 obj_01)
       (pred_10 obj_07 obj_25)
       (pred_10 obj_07 obj_19)
       (pred_10 obj_10 obj_04)
       (pred_10 obj_10 obj_17)
       (pred_10 obj_10 obj_16)
       (pred_10 obj_17 obj_20)
       (pred_10 obj_17 obj_14)
       (pred_10 obj_17 obj_18)
       (pred_10 obj_17 obj_10)
       (pred_10 obj_14 obj_13)
       (pred_10 obj_14 obj_06)
       (pred_10 obj_14 obj_11)
       (pred_10 obj_14 obj_17)
       (pred_10 obj_06 obj_05)
       (pred_10 obj_06 obj_01)
       (pred_10 obj_06 obj_19)
       (pred_10 obj_06 obj_14)
       (pred_10 obj_01 obj_27)
       (pred_10 obj_01 obj_07)
       (pred_10 obj_01 obj_06)
       (pred_10 obj_04 obj_20)
       (pred_10 obj_04 obj_10)
       (pred_10 obj_20 obj_13)
       (pred_10 obj_20 obj_17)
       (pred_10 obj_20 obj_04)
       (pred_10 obj_13 obj_05)
       (pred_10 obj_13 obj_14)
       (pred_10 obj_13 obj_20)
       (pred_10 obj_05 obj_27)
       (pred_10 obj_05 obj_06)
       (pred_10 obj_05 obj_13)
       (pred_10 obj_27 obj_01)
       (pred_10 obj_27 obj_05)
       (pred_5 obj_21)
       (pred_5 obj_08)
       (pred_5 obj_01)
       (pred_4  obj_21 obj_02)
       (pred_4  obj_08 obj_28)
       (pred_4  obj_01 obj_28)
       (pred_7 obj_23)
       (pred_7 obj_30)
       (pred_7 obj_15)
       (pred_7 obj_03)
       (pred_7 obj_22)
       (pred_7 obj_26)
       (pred_7 obj_24)
       (pred_7 obj_25)
       (pred_7 obj_16)
       (pred_7 obj_18)
       (pred_7 obj_11)
       (pred_7 obj_19)
       (pred_7 obj_07)
       (pred_7 obj_10)
       (pred_7 obj_17)
       (pred_7 obj_14)
       (pred_7 obj_06)
       (pred_7 obj_04)
       (pred_7 obj_20)
       (pred_7 obj_13)
       (pred_7 obj_05)
       (pred_7 obj_27)

       (pred_11  obj_12 obj_02)
       (pred_11  obj_29 obj_28)
       (pred_11  obj_09 obj_02)
       (pred_9 obj_12 obj_23)
       (pred_9 obj_29 obj_14)
       (pred_9 obj_09 obj_23)
       (pred_8 obj_20)
    )

    (:goal (and
       (pred_9 obj_29 obj_03)
    ))
(:constraints
  (always (not (pred_8 obj_17)))
)
)

; plan
1. (op_3 obj_20 obj_13)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_13)
   goals met: 0 of 1
2. (op_3 obj_13 obj_14)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_14)
   goals met: 0 of 1
3. (op_2 obj_14 obj_29)
   deleted: (pred_9 obj_29 obj_14) (pred_3)
   added: (pred_6 obj_29)
   goals met: 0 of 1
4. (op_3 obj_14 obj_11)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_11)
   goals met: 0 of 1
5. (op_3 obj_11 obj_26)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_26)
   goals met: 0 of 1
6. (op_3 obj_26 obj_30)
   deleted: (pred_8 obj_26)
   added: (pred_8 obj_30)
   goals met: 0 of 1
7. (op_3 obj_30 obj_15)
   deleted: (pred_8 obj_30)
   added: (pred_8 obj_15)
   goals met: 0 of 1
8. (op_3 obj_15 obj_03)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_03)
   goals met: 0 of 1
9. (op_1 obj_03 obj_29)
   deleted: (pred_6 obj_29)
   added: (pred_3) (pred_9 obj_29 obj_03)
   goals met: 1 of 1
